# ConnectorManager Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPCurve..::..ConnectorManager Property
MEPCurve Class See Also
---
The connector manager of this MEP curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ConnectorManager ConnectorManager { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ConnectorManager As ConnectorManager
	Get
```

Visual C++
---
```text
public:
property ConnectorManager^ ConnectorManager {
	ConnectorManager^ get ();
}
```

# See Also
MEPCurve Class
Autodesk.Revit.DB Namespace